let openData = [
  {
    "id": 1,
    "name": "永康身心診所",
    "dist": "中正區",
    "addr": "金山南路一段127號",
    "tel": "(02)2358-1818"
  },
  {
    "id": 2,
    "name": "平安身心精神科診所",
    "dist": "中正區",
    "addr": "羅斯福路三段218號",
    "tel": "(02)2368-0055"
  },
  {
    "id": 3,
    "name": "蘭心診所",
    "dist": "中正區",
    "addr": "南昌路二段11號、15號",
    "tel": "(02)2351-5995"
  },
  {
    "id": 4,
    "name": "大心古亭診所",
    "dist": "中正區",
    "addr": "南昌路二段206號5樓之1",
    "tel": "(02)2367-6883"
  },
  {
    "id": 5,
    "name": "孫睿亮診所",
    "dist": "中正區",
    "addr": "金山南路一段121號",
    "tel": "(02)2392-6233"
  },
  {
    "id": 6,
    "name": "捷思身心醫學診所",
    "dist": "大安區",
    "addr": "復興南路2段236號12樓之3",
    "tel": "(02)2322-1739"
  },
  {
    "id": 7,
    "name": "醫療財團法人徐元智先生醫藥基金會遠東聯合診所",
    "dist": "中正區",
    "addr": "永綏街8至14號",
    "tel": "(02)2311-1525"
  },
  {
    "id": 8,
    "name": "夏凱納生活診所",
    "dist": "大同區",
    "addr": "五原路15號、19號2樓",
    "tel": "(02)2555-8313"
  },
  {
    "id": 9,
    "name": "中山抱抱心身醫學診所",
    "dist": "大同區",
    "addr": "承德路1段105號5樓",
    "tel": "(02)2559-0381"
  },
  {
    "id": 10,
    "name": "澄心診所",
    "dist": "中山區",
    "addr": "中山北路二段82號2樓",
    "tel": "(02)2523-0480"
  },
  {
    "id": 11,
    "name": "振芝沃本診所",
    "dist": "中山區",
    "addr": "復興北路290號2樓之1",
    "tel": "(02)2502-2205"
  },
  {
    "id": 12,
    "name": "進安身心診所",
    "dist": "中山區",
    "addr": "北安路593號、593號地下",
    "tel": "(02)2533-0726"
  },
  {
    "id": 13,
    "name": "黃雅芬兒童心智診所",
    "dist": "中山區",
    "addr": "南京西路5之1號12樓之1",
    "tel": "0910-222-280"
  },
  {
    "id": 14,
    "name": "振芝心身醫學診所",
    "dist": "中山區",
    "addr": "復興北路282號2樓",
    "tel": "(02)2506-9169"
  },
  {
    "id": 15,
    "name": "心禾診所",
    "dist": "中山區",
    "addr": "復興北路92號11樓、11樓之1",
    "tel": "(02)2750-6122"
  },
  {
    "id": 16,
    "name": "鈺璽診所",
    "dist": "中山區",
    "addr": "南京東路二段132號4樓",
    "tel": "(02)2509-5569"
  },
  {
    "id": 17,
    "name": "慶生診所",
    "dist": "中山區",
    "addr": "林森北路561號2樓之7及之8",
    "tel": "(02)2596-3456"
  },
  {
    "id": 18,
    "name": "微煦心靈診所",
    "dist": "中山區",
    "addr": "中山北路二段39巷6號2樓之1",
    "tel": "(02)2531-2626"
  },
  {
    "id": 19,
    "name": "黃偉俐診所",
    "dist": "中山區",
    "addr": "天津街37號2樓",
    "tel": "(02)2511-4123"
  },
  {
    "id": 20,
    "name": "樂康診所",
    "dist": "松山區",
    "addr": "八德路三段 213號1樓",
    "tel": "(02)2578-8360"
  },
  {
    "id": 21,
    "name": "双悅診所",
    "dist": "松山區",
    "addr": "南京東路5段163之1號(1、2樓)",
    "tel": "(02)2760-9122"
  },
  {
    "id": 22,
    "name": "邱楠超診所",
    "dist": "松山區",
    "addr": "延吉街20號1樓",
    "tel": "(02)2570-2296"
  },
  {
    "id": 23,
    "name": "李政洋身心診所",
    "dist": "松山區",
    "addr": "三民路84號",
    "tel": "(02)2762-0086"
  },
  {
    "id": 24,
    "name": "昱捷診所",
    "dist": "松山區",
    "addr": "南京東路4段143號5樓",
    "tel": "(02)2700-2709"
  },
  {
    "id": 25,
    "name": "向陽身心診所",
    "dist": "大安區",
    "addr": "忠孝東路4段218之2號2樓",
    "tel": "(02)8771-3000"
  },
  {
    "id": 26,
    "name": "大安身心診所",
    "dist": "大安區",
    "addr": "和平東路2段18之9號",
    "tel": "(02)2365-8680"
  },
  {
    "id": 27,
    "name": "大心診所",
    "dist": "大安區",
    "addr": "忠孝東路4段205巷7弄13號2樓、153號6樓",
    "tel": "(02)2771-8821"
  },
  {
    "id": 28,
    "name": "晴天身心診所",
    "dist": "大安區",
    "addr": "延吉街135之3號2樓",
    "tel": "(02)8771-6545"
  },
  {
    "id": 29,
    "name": "自體心理診所",
    "dist": "大安區",
    "addr": "延吉街153之9號3樓",
    "tel": "(02)2775-4121"
  },
  {
    "id": 30,
    "name": "光慧診所",
    "dist": "大安區",
    "addr": "復興南路二段176號",
    "tel": "(02)2755-5627"
  },
  {
    "id": 31,
    "name": "主愛心靈診所",
    "dist": "大安區",
    "addr": "羅斯福路3段269巷39號1樓",
    "tel": "(02)2365-1224"
  },
  {
    "id": 32,
    "name": "宇寧身心診所",
    "dist": "大安區",
    "addr": "復興南路2段6號3樓",
    "tel": "(02)2708-0706"
  },
  {
    "id": 33,
    "name": "光能身心診所",
    "dist": "大安區",
    "addr": "忠孝東路四段15號8樓",
    "tel": "(02)2721-4322"
  },
  {
    "id": 34,
    "name": "林青穀家庭醫學科診所",
    "dist": "大安區",
    "addr": "大安路1段2之1號",
    "tel": "(02)2731-7557"
  },
  {
    "id": 35,
    "name": "杏語心靈診所",
    "dist": "大安區",
    "addr": "復興南路1段200號11樓",
    "tel": "(02)2775-1526"
  },
  {
    "id": 36,
    "name": "尹書田醫療財團法人書田泌尿科眼科診所",
    "dist": "大安區",
    "addr": "建國南路2段276號1樓、2樓、4樓、4樓之1、B1、B1之1、278號1樓",
    "tel": "(02)2369-0211"
  },
  {
    "id": 37,
    "name": "看見身心平衡診所",
    "dist": "大安區",
    "addr": "忠孝東路3段305號9樓之6",
    "tel": "(02)2771-1854"
  },
  {
    "id": 38,
    "name": "振芝映煦心身醫學診所",
    "dist": "大安區",
    "addr": "信義路4段341號8樓之1",
    "tel": "(02)2703-0082"
  },
  {
    "id": 39,
    "name": "福全身心科診所",
    "dist": "萬華區",
    "addr": "中華路二段600號",
    "tel": "(02)2332-7712"
  },
  {
    "id": 40,
    "name": "萬華身心精神科診所",
    "dist": "萬華區",
    "addr": "和平西路3段142號",
    "tel": "(02)2308-8878"
  },
  {
    "id": 41,
    "name": "新佑泉診所",
    "dist": "信義區",
    "addr": "忠孝東路5段508之4號",
    "tel": "(02)2346-5772"
  },
  {
    "id": 42,
    "name": "伯特利身心診所",
    "dist": "信義區",
    "addr": "光復南路421號2樓",
    "tel": "(02)2720-0938"
  },
  {
    "id": 43,
    "name": "松德精神科診所",
    "dist": "信義區",
    "addr": "松德路108號",
    "tel": "(02)8789-4477"
  },
  {
    "id": 44,
    "name": "信義身心精神科診所",
    "dist": "信義區",
    "addr": "莊敬路412號",
    "tel": "(02)2758-0988"
  },
  {
    "id": 45,
    "name": "聿康診所",
    "dist": "信義區",
    "addr": "忠孝東路五段250號2樓",
    "tel": "(02)8786-7727"
  },
  {
    "id": 46,
    "name": "臺北市政府醫務室",
    "dist": "信義區",
    "addr": "市府路1號(1樓東區)",
    "tel": "(02)2728-7164"
  },
  {
    "id": 47,
    "name": "天晴診所",
    "dist": "士林區",
    "addr": "中山北路六段292號、292號2樓",
    "tel": "(02)2835-5329"
  },
  {
    "id": 48,
    "name": "天母康健身心診所",
    "dist": "士林區",
    "addr": "德行西路100號",
    "tel": "(02)2837-8787"
  },
  {
    "id": 49,
    "name": "自由想心理診所",
    "dist": "士林區",
    "addr": "福華路122號2樓",
    "tel": "(02)2831-4837"
  },
  {
    "id": 50,
    "name": "社子安心診所",
    "dist": "士林區",
    "addr": "延平北路五段76號",
    "tel": "(02)2813-6622"
  },
  {
    "id": 51,
    "name": "石牌鄭身心醫學診所",
    "dist": "北投區",
    "addr": "石牌路一段69號(實際使用:1、2樓)",
    "tel": "(02)2822-7660"
  },
  {
    "id": 52,
    "name": "奇岩身心診所",
    "dist": "北投區",
    "addr": "中央南路一段191、193號",
    "tel": "(02)2891-9008"
  },
  {
    "id": 53,
    "name": "北辰身心醫學診所",
    "dist": "北投區",
    "addr": "光明路2巷9之3號、9之3號2樓",
    "tel": "(02)2892-5500"
  },
  {
    "id": 54,
    "name": "夏一新身心精神科診所",
    "dist": "內湖區",
    "addr": "成功路三段143號4樓",
    "tel": "(02)8792-8213"
  },
  {
    "id": 55,
    "name": "內湖身心精神科診所",
    "dist": "內湖區",
    "addr": "內湖路1段439號1樓",
    "tel": "(02)2627-1028"
  },
  {
    "id": 56,
    "name": "林威廷身心精神科診所",
    "dist": "內湖區",
    "addr": "東湖路10號",
    "tel": "(02)2630-8128"
  },
  {
    "id": 57,
    "name": "國泰醫療財團法人內湖國泰診所",
    "dist": "內湖區",
    "addr": "瑞光路337號(1、2、3、4樓)",
    "tel": "(02)8797-2121"
  },
  {
    "id": 58,
    "name": "開馨診所",
    "dist": "南港區",
    "addr": "南港路二段38巷6之1號",
    "tel": "(02)2653-2987"
  },
  {
    "id": 59,
    "name": "和沛身心醫學診所",
    "dist": "文山區",
    "addr": "羅斯福路五段232號",
    "tel": "(02)2935-0330"
  },
  {
    "id": 60,
    "name": "木柵身心診所",
    "dist": "文山區",
    "addr": "辛亥路四段246號",
    "tel": "(02)2930-1550"
  },
  {
    "id": 61,
    "name": "交感身心診所",
    "dist": "大安區",
    "addr": "信義路4段143號4樓",
    "tel": "(02)7730-6840"
  },
  {
    "id": 62,
    "name": "方舟身心診所",
    "dist": "文山區",
    "addr": "興隆路3段84號2樓",
    "tel": "(02)2930-8099"
  },
  {
    "id": 63,
    "name": "誠心身心醫學診所",
    "dist": "文山區",
    "addr": "羅斯福路6段138號1樓",
    "tel": "(02)8663-1380"
  },
  {
    "id": 64,
    "name": "心築身心診所",
    "dist": "士林區",
    "addr": "劍潭路28號1樓、30號1樓",
    "tel": "(02)2885-6572"
  },
  {
    "id": 65,
    "name": "士林身心醫學診所",
    "dist": "士林區",
    "addr": "文林路410號(1、2樓)",
    "tel": "(02)2881-2205"
  },
  {
    "id": 66,
    "name": "得心身醫學台北總診所",
    "dist": "中山區",
    "addr": "復興北路60號3樓之2",
    "tel": "(02)2751-0089"
  },
  {
    "id": 67,
    "name": "伯特利敦南身心診所",
    "dist": "大安區",
    "addr": "和平東路3段1巷51號2樓",
    "tel": "(02)2701-0622"
  },
  {
    "id": 68,
    "name": "新田身心診所",
    "dist": "中山區",
    "addr": "復興北路344號2樓",
    "tel": "(02)2500-0301"
  },
  {
    "id": 69,
    "name": "偉俐民生診所",
    "dist": "中山區",
    "addr": "龍江路245號1樓",
    "tel": "(02)2516-8123"
  },
  {
    "id": 70,
    "name": "牧人所身心醫學診所",
    "dist": "大同區",
    "addr": "承德路3段232號1樓",
    "tel": "(02)2596-5995"
  },
  {
    "id": 71,
    "name": "張國榮身心診所",
    "dist": "士林區",
    "addr": "德行東路179號1樓",
    "tel": "(02)2838-2222"
  },
  {
    "id": 72,
    "name": "抱抱心身醫學診所",
    "dist": "內湖區",
    "addr": "文德路70號1樓及72號1樓",
    "tel": "(02)8797-4422"
  },
  {
    "id": 73,
    "name": "馨思診所",
    "dist": "大安區",
    "addr": "羅斯福路2段41號7樓之1",
    "tel": "(02)3393-3369"
  },
  {
    "id": 74,
    "name": "慢活靜心診所",
    "dist": "中正區",
    "addr": "博愛路105號3樓",
    "tel": "(02)7752-9829"
  },
  {
    "id": 75,
    "name": "公館得心身醫學診所",
    "dist": "大安區",
    "addr": "羅斯福路3段281號3樓之1、3樓之2",
    "tel": "(02)2368-1515"
  },
  {
    "id": 76,
    "name": "沐慕身心診所",
    "dist": "中山區",
    "addr": "四平街20號5樓",
    "tel": "(02)2581-7765"
  },
  {
    "id": 77,
    "name": "康迎健康診所",
    "dist": "大安區",
    "addr": "忠孝東路4段76號2樓",
    "tel": "(02)2772-8881"
  },
  {
    "id": 78,
    "name": "萬華維沐身心診所",
    "dist": "萬華區",
    "addr": "西藏路113號1樓",
    "tel": "(02)2303-5690"
  },
  {
    "id": 79,
    "name": "長源身心診所",
    "dist": "信義區",
    "addr": "永吉路525號1樓",
    "tel": "(02)2765-5077"
  },
  {
    "id": 80,
    "name": "士林抱抱心身醫學診所",
    "dist": "士林區",
    "addr": "中山北路5段476號7樓",
    "tel": "(02)2883-5477"
  },
  {
    "id": 81,
    "name": "怡心診所",
    "dist": "大安區",
    "addr": "大安路1段169巷7號1樓",
    "tel": "(02)2707-0112"
  },
  {
    "id": 82,
    "name": "劉宗憲身心診所",
    "dist": "松山區",
    "addr": "八德路3段134號(1、2樓)",
    "tel": "(02)2579-4888"
  }
];